app/views/devise/registrations/new.html.erb

SELECT "roles".* FROM "roles"
---
    <label style="color:grey;font-size:14px;font-family: inherit;"> Choose Role</label>
    <%= f.collection_select :role_id, Role.all, :id, :user_roles %>